temp/zipCodeEnvelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:erp="http://e-arvetekeskus.eu/erp">
<soapenv:Header/>
<soapenv:Body>
<erp:BuyInvoiceExportRequest since="26-02-2009 00:00:00" authPhrase="106549:elbevswsackajyafdoupavfwewuiafbeeiqatgvyqcqdqxairz">
<erp:state>RECEIVED</erp:state>
<erp:state>VERIFIED</erp:state>
<erp:state>FORPAY</erp:state>
<erp:state>BEING_VERIFIED</erp:state>
<erp:state>DECLINED</erp:state>
<erp:state>PAID</erp:state>
<erp:state>RETURNED_TO_SENDER</erp:state>
</erp:BuyInvoiceExportRequest>
</soapenv:Body>
</soapenv:Envelope>